Router(config)#router eigrp 100
Router(config-router)#netwo
Router(config-router)#network 3.3.3.0 0.0.0.3
Router(config-router)#red
Router(config-router)#redistribute s
Router(config-router)#redistribute static su
Router(config-router)#redistribute static sub
Router(config-router)#redistribute static subn
Router(config-router)#redistribute static ?
  metric  Metric for redistributed routes
  <cr>
Router(config-router)#redistribute static 3
                                          ^
% Invalid input detected at '^' marker.
	
Router(config-router)#redistribute static me
Router(config-router)#redistribute static metric  ?
  <1-4294967295>  Bandwidth metric in Kbits per second
Router(config-router)#redistribute static metric     45682 ?
  <0-4294967295>  EIGRP delay metric, in 10 microsecond units
Router(config-router)#redistribute static metric     45682  4985 ?
  <0-255>  EIGRP reliability metric where 255 is 100% reliable
Router(config-router)#redistribute static metric     45682  4985  255 ?
  <1-255>  EIGRP Effective bandwidth metric (Loading) where 255 is 100% loaded
Router(config-router)#redistribute static metric     45682  4985  255 255 ?
  <1-65535>  EIGRP MTU of the path
Router(config-router)#redistribute static metric     45682  4985  255 255  354 ?
  <cr>
Router(config-router)#redistribute static metric     45682  4985  255 255  354 
Router(config-router)#
%SYS-5-CONFIG_I: Configured from console by console

%DUAL-5-NBRCHANGE: IP-EIGRP 100: Neighbor 3.3.3.1 (GigabitEthernet0/1) is up: new adjacency

Router(config-router)#
Router(config-router)#
Router(config-router)#
Router(config-router)#exit
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#rou
Router(config)#router os
Router(config)#router ospf 1
Router(config-router)#net
Router(config-router)#network 5.5.5.0 0.0.0.3 are
Router(config-router)#network 5.5.5.0 0.0.0.3 area 0
Router(config-router)#
00:15:54: %OSPF-5-ADJCHG: Process 1, Nbr 7.7.7.2 on GigabitEthernet0/2 from LOADING to FULL, Loading Done

Router(config-router)#
Router(config-router)#
Router(config-router)#
Router(config-router)#
Router(config-router)#re
Router(config-router)#redistribute e
Router(config-router)#redistribute eigrp 100 ?
  metric       Metric for redistributed routes
  metric-type  OSPF/IS-IS exterior metric type for redistributed routes
  subnets      Consider subnets for redistribution into OSPF
  tag          Set tag for routes redistributed into OSPF
  <cr>
Router(config-router)#redistribute eigrp 100 sub
Router(config-router)#redistribute eigrp 100 subnets 
Router(config-router)#exit
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#ip r
Router(config)#ip rou
Router(config)#ip route 
Router(config)#ip route 0.0.0.0 0.0.0.0 5.5.5.2
Router(config)#
Router(config)#
Router(config)#
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#
Router#show ip rou
Router#show ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is 4.4.4.1 to network 0.0.0.0

     1.0.0.0/30 is subnetted, 1 subnets
D       1.1.1.0/30 [90/3072] via 3.3.3.1, 00:06:00, GigabitEthernet0/1
     2.0.0.0/30 is subnetted, 1 subnets
D       2.2.2.0/30 [90/3072] via 3.3.3.1, 00:06:00, GigabitEthernet0/1
     3.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       3.3.3.0/30 is directly connected, GigabitEthernet0/1
L       3.3.3.2/32 is directly connected, GigabitEthernet0/1
     4.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       4.4.4.0/30 is directly connected, GigabitEthernet0/0
L       4.4.4.2/32 is directly connected, GigabitEthernet0/0
     5.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       5.5.5.0/30 is directly connected, GigabitEthernet0/2
L       5.5.5.1/32 is directly connected, GigabitEthernet0/2
     6.0.0.0/30 is subnetted, 1 subnets
O       6.6.6.0/30 [110/2] via 5.5.5.2, 00:04:24, GigabitEthernet0/2
     7.0.0.0/30 is subnetted, 1 subnets
O       7.7.7.0/30 [110/2] via 5.5.5.2, 00:04:24, GigabitEthernet0/2
     10.0.0.0/24 is subnetted, 2 subnets
O       10.10.40.0/24 [110/3] via 5.5.5.2, 00:04:24, GigabitEthernet0/2
O       10.10.50.0/24 [110/3] via 5.5.5.2, 00:04:24, GigabitEthernet0/2
D    192.168.10.0/24 [90/28672] via 3.3.3.1, 00:06:00, GigabitEthernet0/1
D    192.168.20.0/24 [90/28672] via 3.3.3.1, 00:06:00, GigabitEthernet0/1
D    192.168.40.0/24 [90/28672] via 3.3.3.1, 00:06:00, GigabitEthernet0/1
S*   0.0.0.0/0 [1/0] via 4.4.4.1
               [1/0] via 3.3.3.1
               [1/0] via 5.5.5.2
Router#








Router con0 is now available






Press RETURN to get started.













Router>
Router>
Router>
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/2
Router(config-if)#